Revit 2026 API

# SpotDimensionFlip Method

---

Flips dimension to the other side of the host.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void Flip()
```
```vb
Public Sub Flip
```
```cpp
public:
void Flip()
```
```fsharp
member Flip : unit -> unit
```

| Exception | Condition |
| --- | --- |
| InvalidOperationException | SpotDimension cannot be flipped. |

#### Reference

SpotDimension Class

Autodesk.Revit.DB Namespace